Revit 2027 API
ParameterTypeId.RenderPlantName Property
 "Plant Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RenderPlantName { get; }
Public Shared ReadOnly Property RenderPlantName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RenderPlantName {
	ForgeTypeId^ get ();
}
static member RenderPlantName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace